Revit 2024 API
HermiteSurface.Create Method
Overload List
Name | Description
Create(Int32, Int32, IList<XYZ>)
 Create a non-periodic Hermite surface using a net of 3D points as input.
Create(Int32, Int32, IList<XYZ>, Boolean, Boolean)
 Create a Hermite surface using a net of 3D points as input. Specify periodicity in U and V direction.
See Also
HermiteSurface Class
HermiteSurface Members
Autodesk.Revit.DB Namespace